CFD/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0; // Initialize relative pressure field to 0

boundaryField
{
    inlet
    {
        type            fixedJump;
        jump            uniform -25; // Pressure jump in Pa
        patchType       cyclic; 
    }
    outlet
	{
        type            fixedJump;
        jump            uniform 0;
        patchType       cyclic;
	}
    topwall
    {
        type            zeroGradient;
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
