CFD/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//dynamicFvMesh dynamicRefineFvMesh;
dynamicFvMesh staticFvMesh;

dynamicRefineFvMeshCoeffs
{
    //How often to refine - JN: e.g. after 10 time steps
    refineInterval  1;

    //Field to be refinement on
    field           alpha.water;

    //Refine field inbetween lower..upper
    //JN: refinement takes place in cells
    //where alpha.water is between 0.01 and 0.99
    lowerRefineLevel 0.1;
    upperRefineLevel 0.9;

    //If value < unrefineLevel unrefine
    //we will unrefine for cells, 
    //where alpha.water is below 10
    //i.e. refine for 0.01-0.99
    //unrefine below 0.01 and above 0.99
    unrefineLevel   0.1;

    // Have slower than 2:1 refinement
    // JN: how many cells in the refinementlayer
    // just an estimate
    nBufferLayers   2;

    //Refine cells only up to maxRefinement levels
    //JN: how many levels do we want
    maxRefinement   2;

    //Stop refinement if maxCells reached
    //maximum allowed number of cells - estimate!
    maxCells        200000;
	
    // Protect regions near cyclic patches
    //protectedPatches
    //(
    //    inlet
    //    outlet
    //);

    //Flux field and corresponding velocity field. Fluxes on changed
    //faces get recalculated by interpolating the velocity. Use 'none'
    //on surfaceScalarFields that do not need to be reinterpolated.
    correctFluxes
    (
        (phi none)
        (nHatf none)
        (rhoPhi none)
        (alphaPhi none)
        (ghf none)
        (flux(alpha.water) none)
		(dVf_ none)
		(alphaPhi_ none)
    );

    //Write the refinement level as a volScalarField
    dumpLevel       true;
	
}


// ************************************************************************* //
