CFD/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    back
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          189000;
        startFace       376010;
    }
    front
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          189000;
        startFace       565010;
    }
    topwall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1890;
        startFace       754010;
    }
    inlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          100;
        startFace       755900;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet;
    }
    outlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          100;
        startFace       756000;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet;
    }
    axis
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       756100;
    }
)

// ************************************************************************* //
