CFD/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water air);

water
{
    transportModel  Newtonian;
    nu              1.0e-05; // kinematic viscosity of mucus
    rho             1000;      // Density of mucus
}

air
{
    transportModel  Newtonian;
    nu              1.5e-05;  // Standard kinematic viscosity of air
    rho             1;         // Density of air
}

sigma               0.05; // Surface tension

// ************************************************************************* //


