CFD/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(

    (0 0 0) // 0
    (0 0.00199809644 -0.00008723877) // 1
    (0.0378 0.00199809644 -0.00008723877) // 2
    (0.0378 0 0) // 3
    (0 0.00199809644 0.00008723877) // 4
    (0.0378 0.00199809644 0.00008723877) // 5

);
 
blocks
(
	hex (0 3 2 1 0 3 5 4) (1890 100 1) simpleGrading (1 1 1)
);

edges
(
    arc 1 4 (0 0.002 0)  // Midpoint for smooth curvature
    arc 2 5 (0.0378 0.002 0) // Midpoint for smooth curvature
);

boundary
(
     back
     { 
           type wedge;
           faces  
           (
               (0 3 2 1)
           );
      }
     front
     { 
           type wedge;
           faces  
           (
               (0 4 5 3)
           );
      }
     topwall
     { 
           type wall;
           faces  
           (
               (1 2 5 4)
           );
      }
     inlet
     { 
			type cyclic;
			neighbourPatch outlet;
           faces  
           (
               (0 4 1 0)
           );
      }
     outlet
     { 
			type cyclic;
			neighbourPatch inlet;
           faces  
           (
               (3 2 5 3)
           );
      }
     axis
     { 
           type empty;
           faces  
           (
               (0 3 3 0)
           );
      }
);
 
mergePatchPairs
(
);

// ************************************************************************* //

